# -*- coding: utf-8 -*-

idol_girl_text = '전소미, 김세정, 최유정, 김청하, 김소혜, 주결경, 정채연, 김도연, 강미나, 임나영, 유연정, 소원, 예린, 은하, 유주, 신비, 엄지, 채경, 채원, 나은, 예나, 레이첼, 진솔, 나라, 앨리스, 라임, 유영, 서영, 여름, 보람, 지연, 효민, 은정, 큐리, 소연, 오승희, 최유진, 장예은, 엘키, 장승연, SORN, 권은빈, 지민, 초아, 유나, 혜정, 민아, 설현, 찬미, 박초롱, 윤보미, 정은지, 손나은, 김남주, 오하영, 나연, 정연, 모모, 사나, 지효, 미나, 다현, 채영, 쯔위, 지아, 민, 수지, 페이'

idol_boy_text = '태일, 쟈니, 태용, 유타, 도영, 텐, 재현, 윈윈, 마크, 런쥔, 제노, 해찬, 재민, 천러, 지성, 지코, 태일, 재효, 비범, 피오, 박경, 유권, JB, 마크, 잭슨, 진영, 영재, 뱀뱀, 유겸, 동현, 현성, 정민, 영민, 광민, 민우, 수호, 찬열, 카이, 디오, 백현, 세훈, 시우민, 레이, 첸, 타오, 루한, 크리스, 온유, 종현, Key, 민호, 태민, 한승우, 강승식, 허찬, 임세준, 도한세, 최병찬, 정수빈, 시월, 재빈, 만니, 리호, 다원, 승보, 블릿, 데이먼, 씬, 엔써니, 키드, 윤호, 서은광, 이민혁, 이창섭, 임현식, 프니엘, 정일훈, 육성재, 진호, 후이, 홍석, 이던, 신원, 여원, 옌안, 유토, 키노, 우석'

idol_girl_list = idol_girl_text.split(', ')
idol_boy_list = idol_boy_text.split(', ')

print(idol_girl_list)
print(idol_boy_list)